<?php

return [
    'home' => [
        'title' => 'Welcome to our website',
        'description' => 'This is the home page provided by esanj/base-pages package.',
    ],

    'labels' => [
        'copyright' => '© :year :brand Platform. All rights reserved.'
    ],

    'errors' => [
        '400' => [
            'title' => "درخواست اشتباه",
            'message' => "درخواست شما به درستی ارسال نشده است. لطفاً داده‌ها و تنظیمات خود را بررسی نموده و مجدداً امتحان نمایید.",
        ],
        '401' => [
            'title' => "دسترسی نامعتبر",
            'message' => "شما برای دسترسی به این صفحه باید ابتدا وارد شوید. لطفاً احراز هویت نمایید.",
        ],
        '403' => [
            'title' => "مجوز نامعتبر",
            'message' => "شما اجازه دسترسی به این منبع را ندارید. جهت کسب دسترسی یا راهنمایی با مدیر سیستم تماس بگیرید.",
        ],
        '404' => [
            'title' => "صفحه پیدا نشد",
            'message' => "صفحه مورد نظر یافت نشد. لطفاً آدرس را مجدداً بررسی کنید.",
        ],
        '419' => [
            'title' => "صفحه منقضی شده است",
            'message' => "نشست شما منقضی شده است. لطفاً صفحه را دوباره بارگذاری (رفرش) کرده و دوباره وارد شوید.",
        ],
        '429' => [
            'title' => "درخواست بیش از حد",
            'message' => "شما بیش از حد مجاز درخواست ارسال کرده‌اید. لطفاً پس از مدتی کوتاه مجدداً اقدام کنید.",
        ],
        '500' => [
            'title' => "خطای داخلی سرور",
            'message' => "خطای داخلی سرور رخ داده است. لطفاً دقایقی بعد مجدداً تلاش کنید و در صورت ادامه مشکل آن را گزارش دهید.",
        ],
        '502' => [
            'title' => "سرویس مقصد خارج از دسترسی",
            'message' => "ارتباط با سرور مقصد به‌درستی برقرار نشد. لطفاً پس از چند لحظه دوباره تلاش کنید.",
        ],
        '503' => [
            'title' => "سرویس خارج از دسترسی",
            'message' => "سرویس موقتاً در دسترس نیست. لطفاً کمی بعد دوباره تلاش کنید.",
        ],
        '504' => [
            'title' => "زمان پاسخگویی بیش از حد",
            'message' => "زمان پاسخ سرور به پایان رسید. لطفاً بعداً مجدداً درخواست خود را ارسال نمایید.",
        ],
    ]
];
